{"format": "graph-model", "generatedBy": "2.17.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "177"}, {"size": "177"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model/tf.compat.v1.transpose_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/tf.__operators__.add/AddV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/tf.expand_dims/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/flatten/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "177"}, {"size": "177"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu/LeakyRelu", "op": "_FusedConv2D", "input": ["input", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.1}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.nn.leaky_relu/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu_1/LeakyRelu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.nn.max_pool2d/MaxPool2d", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.1}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d_1/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.nn.leaky_relu_1/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu_2/LeakyRelu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.nn.max_pool2d_1/MaxPool2d", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.1}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d_2/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.nn.leaky_relu_2/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu_3/LeakyRelu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/tf.nn.max_pool2d_2/MaxPool2d", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.1}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/tf.nn.max_pool2d_3/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model/tf.nn.leaky_relu_3/LeakyRelu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/tf.math.reduce_mean/Mean", "op": "Mean", "input": ["PartitionedCall/model/tf.nn.max_pool2d_3/MaxPool2d", "PartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model/tf.compat.v1.transpose_2/transpose", "op": "Transpose", "input": ["PartitionedCall/model/tf.math.reduce_mean/Mean", "PartitionedCall/model/tf.compat.v1.transpose_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.compat.v1.shape/wa/Shape", "op": "Shape", "input": ["PartitionedCall/model/tf.math.reduce_mean/Mean"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT64"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT64"}]}]}}, {"name": "PartitionedCall/model/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["PartitionedCall/model/tf.compat.v1.shape/wa/Shape", "PartitionedCall/model/tf.__operators__.add/AddV2", "PartitionedCall/model/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT64"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model/tf.expand_dims/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model/tf.compat.v1.gather/GatherV2", "PartitionedCall/model/tf.expand_dims/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/tf.concat/concat", "op": "ConcatV2", "input": ["PartitionedCall/model/tf.expand_dims/ExpandDims", "unknown_9", "PartitionedCall/model/tf.concat/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/tf.reshape/Reshape", "op": "Reshape", "input": ["PartitionedCall/model/tf.compat.v1.transpose_2/transpose", "PartitionedCall/model/tf.concat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model/flatten/Shape", "op": "Shape", "input": ["PartitionedCall/model/tf.reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/model/flatten/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/model/flatten/Shape", "PartitionedCall/model/flatten/strided_slice/stack", "PartitionedCall/model/flatten/strided_slice/stack_1", "PartitionedCall/model/flatten/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/flatten/Reshape/shape", "op": "Pack", "input": ["PartitionedCall/model/flatten/strided_slice", "PartitionedCall/model/flatten/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/model/tf.reshape/Reshape", "PartitionedCall/model/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/tf.__operators__.add_1/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model/flatten/Reshape", "unknown_10", "unknown_12"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_2/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.__operators__.add_1/AddV2", "unknown_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.__operators__.add_2/AddV2", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.multiply_2/Mul", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu_4/LeakyRelu", "op": "LeakyRelu", "input": ["PartitionedCall/model/tf.__operators__.add_2/AddV2"], "attr": {"alpha": {"f": 0.1}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.__operators__.add_3/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model/tf.nn.leaky_relu_4/LeakyRelu", "unknown_15", "unknown_17"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.math.multiply_4/Mul", "op": "Mul", "input": ["PartitionedCall/model/tf.__operators__.add_3/AddV2", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.__operators__.add_4/AddV2", "op": "AddV2", "input": ["PartitionedCall/model/tf.math.multiply_4/Mul", "unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/tf.nn.leaky_relu_5/LeakyRelu", "op": "LeakyRelu", "input": ["PartitionedCall/model/tf.__operators__.add_4/AddV2"], "attr": {"alpha": {"f": 0.1}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/output/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model/tf.nn.leaky_relu_5/LeakyRelu", "unknown_20", "unknown_22"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model/output/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "PartitionedCall/model/tf.compat.v1.transpose_2/transpose/perm", "shape": [4], "dtype": "int32"}, {"name": "unknown", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "unknown_0", "shape": [64], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "unknown_2", "shape": [128], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "unknown_4", "shape": [256], "dtype": "float32"}, {"name": "unknown_5", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "unknown_6", "shape": [512], "dtype": "float32"}, {"name": "PartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/model/tf.__operators__.add/AddV2", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model/tf.compat.v1.gather/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model/tf.expand_dims/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "unknown_9", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model/tf.concat/concat/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model/flatten/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "unknown_10", "shape": [512, 1024], "dtype": "float32"}, {"name": "unknown_12", "shape": [1024], "dtype": "float32"}, {"name": "unknown_13", "shape": [1024], "dtype": "float32"}, {"name": "unknown_14", "shape": [1024], "dtype": "float32"}, {"name": "unknown_15", "shape": [1024, 512], "dtype": "float32"}, {"name": "unknown_17", "shape": [512], "dtype": "float32"}, {"name": "unknown_18", "shape": [512], "dtype": "float32"}, {"name": "unknown_19", "shape": [512], "dtype": "float32"}, {"name": "unknown_20", "shape": [512, 10], "dtype": "float32"}, {"name": "unknown_22", "shape": [10], "dtype": "float32"}]}]}